# -*- coding: utf8 -*-
__author__ = 'Anton Glukhov'

from flask.ext.login import login_required, login_user

from TrackerRestApi import jsonrpc, app
from TrackerRestApi import Session

from flask_jsonrpc import ServerError, InvalidParamsError
from sqlautocode_gen.model import *

from modules import *


def fillFineResponse(f):

    ret = {
        "id": f.id,
        "date": f.date,
        "penalty": f.penalty,
        "group": f.group,
        "address": f.address,
        "state": f.state,
        "decree": f.decree,
        "model": f.model,
        "number": f.number,
    }

    return ret


@jsonrpc.method('getFines(user_id=Number) -> Any', validate=True, authenticated=False)
def getFines(user_id):

    session = Session()

    lst = [
        {
            "id": 0,
            "vehicle_id": 43,
            "date": 1392045300,
            "penalty": 500,
            "group": u'Нарушение правил остановки или стоянки транспортных средств',
            "address": u'г.Москва, Можайское шоссе, д.58',
            "state": 0,
            "decree": u'18810277145090058972',
            "model": u'ГАЗ3106',
            "number": u'Р173АА777',
            "name": u'Иванов Игорь Вячеславович',
            "type": u'Постановление-квитанция',
            "clause": u'12.15ч.1',
            "text": u'Нарушение правил расположнения транспортного средства на проезжей части дороги, '
                    u'встречного разъезда или обгона без выезда на сторону проезжей части дороги,'
                    u'предназначенную для встречного движения. Пересечение организованной транспортной '
                    u'или пешей колоны либо занятие места в ней. Движение по обочинам.',
            "pic": None
        },
        {
            "id": 1,
            "vehicle_id": 44,
            "date": 1394038500,
            "penalty": 500,
            "group": u'Нарушение правил пользования приборами',
            "address": u'г.Москва, д. Рязаново, д.25',
            "state": 1,
            "decree": u'01МО6688123',
            "model": u'ГАЗ3106',
            "number": u'Р173АА777',
            "name": u'Иванов Игорь Вячеславович',
            "type": u'Постановление-квитанция',
            "clause": u'12.20',
            "text": u'Нарушение правил пользования внешними световыми приборами, звуковыми сигналами, '
                    u'аварийной сигнализацией или знаком аварийной остановки',
            "pic": None
        },
        {
            "id": 2,
            "vehicle_id": 51,
            "date": 1394038400,
            "penalty": 1500,
            "group": u'Управление транспортным средством с нечитаемыми регистрационными знаками',
            "address": u'г.Москва, Угрешский 1-й проезд, стр.10',
            "state": 2,
            "decree": u'77МО6688796',
            "model": u'ГАЗ3106',
            "number": u'Р173АА777',
            "name": u'Иванов Игорь Вячеславович',
            "type": u'Постановление-квитанция',
            "clause": u'12.2 ч.1',
            "text": u'Управление транспортным средством с нечитаемыми, нестандартными или '
                    u'установленными с нарушением требований государственного стандарта '
                    u'государственными регистрационными знаками, за исключением случаев, '
                    u'предусмотренных частью 2 настоящей статьи Примечание. Государственный '
                    u'регистрационный знак признается нестандартным, если он не соответствует '
                    u'требованиям, установленным в соответствии с законодательством о техническом '
                    u'регулировании, и нечитаемым, если с расстояния 20 метров не обеспечивается '
                    u'прочтение в темное время суток хотя бы одной из букв или цифр заднего '
                    u'государственного регистрационного знака, а в светлое время суток хотя бы '
                    u'одной из букв или цифр переднего или заднего государственного регистрационного '
                    u'знака.',
            "pic": None
        }
    ]

    session.close()

    return lst
